espressif/arduino-esp32/libraries/BLE/src/BLEAdvertising.cpp
void BLEAdvertising::reset() {
  if (BLEDevice::getInitialized()) {
    stop();
  }

  memset(&m_scanRespData, 0, sizeof(esp_ble_adv_data_t));
  memset(&m_advData, 0, sizeof(esp_ble_adv_data_t));
  memset(&m_advParams, 0, sizeof(esp_ble_adv_params_t));

  m_advData.set_scan_rsp = false;
  m_advData.include_name = true;
  m_advData.include_txpower = true;
  m_advData.min_interval = 0x20;
  m_advData.max_interval = 0x40;
  m_advData.appearance = 0x00;
  m_advData.manufacturer_len = 0;
  m_advData.p_manufacturer_data = nullptr;
  m_advData.service_data_len = 0;
  m_advData.p_service_data = nullptr;
  m_advData.service_uuid_len = 0;
  m_advData.p_service_uuid = nullptr;
  m_advData.flag = (ESP_BLE_ADV_FLAG_GEN_DISC | ESP_BLE_ADV_FLAG_BREDR_NOT_SPT);

  m_advParams.adv_int_min = 0x20;
  m_advParams.adv_int_max = 0x40;
  m_advParams.adv_type = ADV_TYPE_IND;
  m_advParams.own_addr_type = BLE_ADDR_TYPE_PUBLIC;
  m_advParams.channel_map = ADV_CHNL_ALL;
  m_advParams.adv_filter_policy = ADV_FILTER_ALLOW_SCAN_ANY_CON_ANY;
  m_advParams.peer_addr_type = BLE_ADDR_TYPE_PUBLIC;

  m_customAdvData = false;           // No custom advertising data
  m_customScanResponseData = false;  // No custom scan response data
  m_advDataSet = false;              // Force advertising data reconfiguration
  m_advConfiguring = false;          // Not currently configuring
}  // BLEAdvertising

void BLEAdvertising::freeServiceUUIDs() {
  free(m_advData.p_service_uuid);
  m_advData.p_service_uuid = nullptr;
}

bool BLEAdvertising::configureScanResponseData() {
  memcpy(&m_scanRespData, &m_advData, sizeof(esp_ble_adv_data_t));
  m_scanRespData.set_scan_rsp = true;
  m_scanRespData.include_name = true;
  m_scanRespData.include_txpower = true;
  m_scanRespData.appearance = 0;
  m_scanRespData.flag = 0;
  esp_err_t errRc = ::esp_ble_gap_config_adv_data(&m_scanRespData);
  if (errRc != ESP_OK) {
    log_e("esp_ble_gap_config_adv_data (Scan response): rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    return false;
  }
  return true;
}

void BLEAdvertising::setAdvertisementChannelMap(esp_ble_adv_channel_t channel_map) {
  m_advParams.channel_map = channel_map;
}  // setAdvertisementChannelMap

/**
 * @brief Start advertising.
 * Start advertising.
 * @return N/A.
 */
bool BLEAdvertising::start() {
  log_v(">> start: customAdvData: %d, customScanResponseData: %d, advDataSet: %d", m_customAdvData, m_customScanResponseData, m_advDataSet);

  // If async configuration is already in progress, don't re-enter.
  // The GAP event handler will start advertising when the config completes.
  if (m_advConfiguring) {
    log_w("Advertising configuration already in progress");
    return true;
  }

  // If advertising data needs to be (re)configured, kick off the async configuration.
  // Bluedroid's esp_ble_gap_config_adv_data() is asynchronous and fires a GAP completion
  // event when done. We must NOT block here with semaphores because start() can be called
  // from BT callbacks (e.g., the disconnect handler), and both GATT and GAP callbacks are
  // dispatched on the same BTC task - blocking would deadlock.
  // Instead, we use the same non-blocking approach as NimBLE: kick off the config and let
  // the GAP event handler (handleGAPEvent) chain the remaining steps.
  if (!m_advDataSet) {
    freeServiceUUIDs();

    // We have a vector of service UUIDs that we wish to advertise.  In order to use the
    // ESP-IDF framework, these must be supplied in a contiguous array of their 128bit (16 byte)
    // representations.  If we have 1 or more services to advertise then we allocate enough
    // storage to host them and then copy them in one at a time into the contiguous storage.
    int numServices = m_serviceUUIDs.size();
    if (numServices > 0) {
      m_advData.service_uuid_len = 16 * numServices;
      m_advData.p_service_uuid = (uint8_t *)malloc(m_advData.service_uuid_len);
      if (!m_advData.p_service_uuid) {
        log_e(">> start failed: out of memory");
        return false;
      }

      uint8_t *p = m_advData.p_service_uuid;
      for (int i = 0; i < numServices; i++) {
        log_d("- advertising service: %s", m_serviceUUIDs[i].toString().c_str());
        BLEUUID serviceUUID128 = m_serviceUUIDs[i].to128();
        memcpy(p, serviceUUID128.getNative()->uuid.uuid128, 16);
        p += 16;
      }
    } else {
      m_advData.service_uuid_len = 0;
      log_d("- no services advertised");
    }

    if (!m_customAdvData) {
      // Configure advertising data asynchronously.
      // The GAP event handler will continue the chain when config completes:
      //   ADV_DATA_SET_COMPLETE -> (scan response config if needed) -> start advertising
      m_advData.set_scan_rsp = false;
      m_advData.include_name = !m_scanResp;
      m_advData.include_txpower = !m_scanResp;
      esp_err_t errRc = ::esp_ble_gap_config_adv_data(&m_advData);
      if (errRc != ESP_OK) {
        log_e("<< esp_ble_gap_config_adv_data: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
        freeServiceUUIDs();
        return false;
      }
      m_advConfiguring = true;
      log_d("Advertising data configuration started (async)");
      return true;
    }

    if (!m_customScanResponseData && m_scanResp) {
      // Custom adv data but auto scan response - configure scan response asynchronously.
      // The GAP event handler will start advertising when config completes.
      if (!configureScanResponseData()) {
        freeServiceUUIDs();
        return false;
      }
      m_advConfiguring = true;
      log_d("Scan response data configuration started (async)");
      return true;
    }

    // Both adv data and scan response are custom (or no scan response needed).
    // No async operations, mark as configured and proceed to start.
    m_advDataSet = true;
    freeServiceUUIDs();
  }

  // Advertising data is already configured, just start advertising.
  esp_err_t errRc = ::esp_ble_gap_start_advertising(&m_advParams);
  if (errRc != ESP_OK) {
    log_e("<< esp_ble_gap_start_advertising: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
  } else {
    log_v("<< start");
  }
  return ESP_OK == errRc;
}  // start

/**
 * @brief Stop advertising.
 * Stop advertising.
 * @return N/A.
 */
bool BLEAdvertising::stop() {
  log_v(">> stop");
  esp_err_t errRc = ::esp_ble_gap_stop_advertising();
  if (errRc != ESP_OK) {
    log_e("esp_ble_gap_stop_advertising: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
  } else {
    log_v("<< stop");
  }
  return ESP_OK == errRc;
}  // stop

void BLEAdvertising::handleGAPEvent(esp_gap_ble_cb_event_t event, esp_ble_gap_cb_param_t *param) {
  log_d("handleGAPEvent [event no: %d]", (int)event);

